GopalSaraf/Practicals/PSDL/include/proc/pic16f18445.inc
// Register: NCO1INCU
#define NCO1INCU NCO1INCU
NCO1INCU                                 equ 0591h
// bitfield definitions
NCO1INCU_INC_POSN                        equ 0000h
NCO1INCU_INC_POSITION                    equ 0000h
NCO1INCU_INC_SIZE                        equ 0004h
NCO1INCU_INC_LENGTH                      equ 0004h
NCO1INCU_INC_MASK                        equ 000Fh
NCO1INCU_NCO1INC16_POSN                  equ 0000h
NCO1INCU_NCO1INC16_POSITION              equ 0000h
NCO1INCU_NCO1INC16_SIZE                  equ 0001h
NCO1INCU_NCO1INC16_LENGTH                equ 0001h
NCO1INCU_NCO1INC16_MASK                  equ 0001h
NCO1INCU_NCO1INC17_POSN                  equ 0001h
NCO1INCU_NCO1INC17_POSITION              equ 0001h
NCO1INCU_NCO1INC17_SIZE                  equ 0001h
NCO1INCU_NCO1INC17_LENGTH                equ 0001h
NCO1INCU_NCO1INC17_MASK                  equ 0002h
NCO1INCU_NCO1INC18_POSN                  equ 0002h
NCO1INCU_NCO1INC18_POSITION              equ 0002h
NCO1INCU_NCO1INC18_SIZE                  equ 0001h
NCO1INCU_NCO1INC18_LENGTH                equ 0001h
NCO1INCU_NCO1INC18_MASK                  equ 0004h
NCO1INCU_NCO1INC19_POSN                  equ 0003h
NCO1INCU_NCO1INC19_POSITION              equ 0003h
NCO1INCU_NCO1INC19_SIZE                  equ 0001h
NCO1INCU_NCO1INC19_LENGTH                equ 0001h
NCO1INCU_NCO1INC19_MASK                  equ 0008h
NCO1INCU_INC16_POSN                      equ 0000h
NCO1INCU_INC16_POSITION                  equ 0000h
NCO1INCU_INC16_SIZE                      equ 0001h
NCO1INCU_INC16_LENGTH                    equ 0001h
NCO1INCU_INC16_MASK                      equ 0001h
NCO1INCU_INC17_POSN                      equ 0001h
NCO1INCU_INC17_POSITION                  equ 0001h
NCO1INCU_INC17_SIZE                      equ 0001h
NCO1INCU_INC17_LENGTH                    equ 0001h
NCO1INCU_INC17_MASK                      equ 0002h
NCO1INCU_INC18_POSN                      equ 0002h
NCO1INCU_INC18_POSITION                  equ 0002h
NCO1INCU_INC18_SIZE                      equ 0001h
NCO1INCU_INC18_LENGTH                    equ 0001h
NCO1INCU_INC18_MASK                      equ 0004h
NCO1INCU_INC19_POSN                      equ 0003h
NCO1INCU_INC19_POSITION                  equ 0003h
NCO1INCU_INC19_SIZE                      equ 0001h
NCO1INCU_INC19_LENGTH                    equ 0001h
NCO1INCU_INC19_MASK                      equ 0008h
NCO1INCU_NCO1INC_POSN                    equ 0000h
NCO1INCU_NCO1INC_POSITION                equ 0000h
NCO1INCU_NCO1INC_SIZE                    equ 0004h
NCO1INCU_NCO1INC_LENGTH                  equ 0004h
NCO1INCU_NCO1INC_MASK                    equ 000Fh

// Register: NCO1CON
#define NCO1CON NCO1CON
NCO1CON                                  equ 0592h
// bitfield definitions
NCO1CON_PFM_POSN                         equ 0000h
NCO1CON_PFM_POSITION                     equ 0000h
NCO1CON_PFM_SIZE                         equ 0001h
NCO1CON_PFM_LENGTH                       equ 0001h
NCO1CON_PFM_MASK                         equ 0001h
NCO1CON_POL_POSN                         equ 0004h
NCO1CON_POL_POSITION                     equ 0004h
NCO1CON_POL_SIZE                         equ 0001h
NCO1CON_POL_LENGTH                       equ 0001h
NCO1CON_POL_MASK                         equ 0010h
NCO1CON_OUT_POSN                         equ 0005h
NCO1CON_OUT_POSITION                     equ 0005h
NCO1CON_OUT_SIZE                         equ 0001h
NCO1CON_OUT_LENGTH                       equ 0001h
NCO1CON_OUT_MASK                         equ 0020h
NCO1CON_EN_POSN                          equ 0007h
NCO1CON_EN_POSITION                      equ 0007h
NCO1CON_EN_SIZE                          equ 0001h
NCO1CON_EN_LENGTH                        equ 0001h
NCO1CON_EN_MASK                          equ 0080h
NCO1CON_NCO1PFM_POSN                     equ 0000h
NCO1CON_NCO1PFM_POSITION                 equ 0000h
NCO1CON_NCO1PFM_SIZE                     equ 0001h
NCO1CON_NCO1PFM_LENGTH                   equ 0001h
NCO1CON_NCO1PFM_MASK                     equ 0001h
NCO1CON_NCO1POL_POSN                     equ 0004h
NCO1CON_NCO1POL_POSITION                 equ 0004h
NCO1CON_NCO1POL_SIZE                     equ 0001h
NCO1CON_NCO1POL_LENGTH                   equ 0001h
NCO1CON_NCO1POL_MASK                     equ 0010h
NCO1CON_NCO1OUT_POSN                     equ 0005h
NCO1CON_NCO1OUT_POSITION                 equ 0005h
NCO1CON_NCO1OUT_SIZE                     equ 0001h
NCO1CON_NCO1OUT_LENGTH                   equ 0001h
NCO1CON_NCO1OUT_MASK                     equ 0020h
NCO1CON_NCO1EN_POSN                      equ 0007h
NCO1CON_NCO1EN_POSITION                  equ 0007h
NCO1CON_NCO1EN_SIZE                      equ 0001h
NCO1CON_NCO1EN_LENGTH                    equ 0001h
NCO1CON_NCO1EN_MASK                      equ 0080h

// Register: NCO1CLK
#define NCO1CLK NCO1CLK
NCO1CLK                                  equ 0593h
// bitfield definitions
NCO1CLK_CKS_POSN                         equ 0000h
NCO1CLK_CKS_POSITION                     equ 0000h
NCO1CLK_CKS_SIZE                         equ 0004h
NCO1CLK_CKS_LENGTH                       equ 0004h
NCO1CLK_CKS_MASK                         equ 000Fh
NCO1CLK_PWS_POSN                         equ 0005h
NCO1CLK_PWS_POSITION                     equ 0005h
NCO1CLK_PWS_SIZE                         equ 0003h
NCO1CLK_PWS_LENGTH                       equ 0003h
NCO1CLK_PWS_MASK                         equ 00E0h
NCO1CLK_CKS0_POSN                        equ 0000h
NCO1CLK_CKS0_POSITION                    equ 0000h
NCO1CLK_CKS0_SIZE                        equ 0001h
NCO1CLK_CKS0_LENGTH                      equ 0001h
NCO1CLK_CKS0_MASK                        equ 0001h
NCO1CLK_CKS1_POSN                        equ 0001h
NCO1CLK_CKS1_POSITION                    equ 0001h
NCO1CLK_CKS1_SIZE                        equ 0001h
NCO1CLK_CKS1_LENGTH                      equ 0001h
NCO1CLK_CKS1_MASK                        equ 0002h
NCO1CLK_CKS2_POSN                        equ 0002h
NCO1CLK_CKS2_POSITION                    equ 0002h
NCO1CLK_CKS2_SIZE                        equ 0001h
NCO1CLK_CKS2_LENGTH                      equ 0001h
NCO1CLK_CKS2_MASK                        equ 0004h
NCO1CLK_CKS3_POSN                        equ 0003h
NCO1CLK_CKS3_POSITION                    equ 0003h
NCO1CLK_CKS3_SIZE                        equ 0001h
NCO1CLK_CKS3_LENGTH                      equ 0001h
NCO1CLK_CKS3_MASK                        equ 0008h
NCO1CLK_PWS0_POSN                        equ 0005h
NCO1CLK_PWS0_POSITION                    equ 0005h
NCO1CLK_PWS0_SIZE                        equ 0001h
NCO1CLK_PWS0_LENGTH                      equ 0001h
NCO1CLK_PWS0_MASK                        equ 0020h
NCO1CLK_PWS1_POSN                        equ 0006h
NCO1CLK_PWS1_POSITION                    equ 0006h
NCO1CLK_PWS1_SIZE                        equ 0001h
NCO1CLK_PWS1_LENGTH                      equ 0001h
NCO1CLK_PWS1_MASK                        equ 0040h
NCO1CLK_PWS2_POSN                        equ 0007h
NCO1CLK_PWS2_POSITION                    equ 0007h
NCO1CLK_PWS2_SIZE                        equ 0001h
NCO1CLK_PWS2_LENGTH                      equ 0001h
NCO1CLK_PWS2_MASK                        equ 0080h
NCO1CLK_NCO1CKS_POSN                     equ 0000h
NCO1CLK_NCO1CKS_POSITION                 equ 0000h
NCO1CLK_NCO1CKS_SIZE                     equ 0004h
NCO1CLK_NCO1CKS_LENGTH                   equ 0004h
NCO1CLK_NCO1CKS_MASK                     equ 000Fh
NCO1CLK_NCO1PWS_POSN                     equ 0005h
NCO1CLK_NCO1PWS_POSITION                 equ 0005h
NCO1CLK_NCO1PWS_SIZE                     equ 0003h
NCO1CLK_NCO1PWS_LENGTH                   equ 0003h
NCO1CLK_NCO1PWS_MASK                     equ 00E0h
NCO1CLK_NCO1CKS0_POSN                    equ 0000h
NCO1CLK_NCO1CKS0_POSITION                equ 0000h
NCO1CLK_NCO1CKS0_SIZE                    equ 0001h
NCO1CLK_NCO1CKS0_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS0_MASK                    equ 0001h
NCO1CLK_NCO1CKS1_POSN                    equ 0001h
NCO1CLK_NCO1CKS1_POSITION                equ 0001h
NCO1CLK_NCO1CKS1_SIZE                    equ 0001h
NCO1CLK_NCO1CKS1_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS1_MASK                    equ 0002h
NCO1CLK_NCO1CKS2_POSN                    equ 0002h
NCO1CLK_NCO1CKS2_POSITION                equ 0002h
NCO1CLK_NCO1CKS2_SIZE                    equ 0001h
NCO1CLK_NCO1CKS2_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS2_MASK                    equ 0004h
NCO1CLK_NCO1CKS3_POSN                    equ 0003h
NCO1CLK_NCO1CKS3_POSITION                equ 0003h
NCO1CLK_NCO1CKS3_SIZE                    equ 0001h
NCO1CLK_NCO1CKS3_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS3_MASK                    equ 0008h
NCO1CLK_NCO1PWS0_POSN                    equ 0005h
NCO1CLK_NCO1PWS0_POSITION                equ 0005h
NCO1CLK_NCO1PWS0_SIZE                    equ 0001h
NCO1CLK_NCO1PWS0_LENGTH                  equ 0001h
NCO1CLK_NCO1PWS0_MASK                    equ 0020h
NCO1CLK_NCO1PWS1_POSN                    equ 0006h
NCO1CLK_NCO1PWS1_POSITION                equ 0006h
NCO1CLK_NCO1PWS1_SIZE                    equ 0001h
NCO1CLK_NCO1PWS1_LENGTH                  equ 0001h
NCO1CLK_NCO1PWS1_MASK                    equ 0040h
NCO1CLK_NCO1PWS2_POSN                    equ 0007h
NCO1CLK_NCO1PWS2_POSITION                equ 0007h
NCO1CLK_NCO1PWS2_SIZE                    equ 0001h
NCO1CLK_NCO1PWS2_LENGTH                  equ 0001h
NCO1CLK_NCO1PWS2_MASK                    equ 0080h

// Register: TMR0L
#define TMR0L TMR0L
TMR0L                                    equ 059Ch
// bitfield definitions
TMR0L_TMR0L_POSN                         equ 0000h
TMR0L_TMR0L_POSITION                     equ 0000h
TMR0L_TMR0L_SIZE                         equ 0008h
TMR0L_TMR0L_LENGTH                       equ 0008h
TMR0L_TMR0L_MASK                         equ 00FFh
TMR0L_TMR0L0_POSN                        equ 0000h
TMR0L_TMR0L0_POSITION                    equ 0000h
TMR0L_TMR0L0_SIZE                        equ 0001h
TMR0L_TMR0L0_LENGTH                      equ 0001h
TMR0L_TMR0L0_MASK                        equ 0001h
TMR0L_TMR0L1_POSN                        equ 0001h
TMR0L_TMR0L1_POSITION                    equ 0001h
TMR0L_TMR0L1_SIZE                        equ 0001h
TMR0L_TMR0L1_LENGTH                      equ 0001h
TMR0L_TMR0L1_MASK                        equ 0002h
TMR0L_TMR0L2_POSN                        equ 0002h
TMR0L_TMR0L2_POSITION                    equ 0002h
TMR0L_TMR0L2_SIZE                        equ 0001h
TMR0L_TMR0L2_LENGTH                      equ 0001h
TMR0L_TMR0L2_MASK                        equ 0004h
TMR0L_TMR0L3_POSN                        equ 0003h
TMR0L_TMR0L3_POSITION                    equ 0003h
TMR0L_TMR0L3_SIZE                        equ 0001h
TMR0L_TMR0L3_LENGTH                      equ 0001h
TMR0L_TMR0L3_MASK                        equ 0008h
TMR0L_TMR0L4_POSN                        equ 0004h
TMR0L_TMR0L4_POSITION                    equ 0004h
TMR0L_TMR0L4_SIZE                        equ 0001h
TMR0L_TMR0L4_LENGTH                      equ 0001h
TMR0L_TMR0L4_MASK                        equ 0010h
TMR0L_TMR0L5_POSN                        equ 0005h
TMR0L_TMR0L5_POSITION                    equ 0005h
TMR0L_TMR0L5_SIZE                        equ 0001h
TMR0L_TMR0L5_LENGTH                      equ 0001h
TMR0L_TMR0L5_MASK                        equ 0020h
TMR0L_TMR0L6_POSN                        equ 0006h
TMR0L_TMR0L6_POSITION                    equ 0006h
TMR0L_TMR0L6_SIZE                        equ 0001h
TMR0L_TMR0L6_LENGTH                      equ 0001h
TMR0L_TMR0L6_MASK                        equ 0040h
TMR0L_TMR0L7_POSN                        equ 0007h
TMR0L_TMR0L7_POSITION                    equ 0007h
TMR0L_TMR0L7_SIZE                        equ 0001h
TMR0L_TMR0L7_LENGTH                      equ 0001h
TMR0L_TMR0L7_MASK                        equ 0080h

// Register: TMR0H
#define TMR0H TMR0H
TMR0H                                    equ 059Dh
// bitfield definitions
TMR0H_TMR0H_POSN                         equ 0000h
TMR0H_TMR0H_POSITION                     equ 0000h
TMR0H_TMR0H_SIZE                         equ 0008h
TMR0H_TMR0H_LENGTH                       equ 0008h
TMR0H_TMR0H_MASK                         equ 00FFh
TMR0H_TMR0H0_POSN                        equ 0000h
TMR0H_TMR0H0_POSITION                    equ 0000h
TMR0H_TMR0H0_SIZE                        equ 0001h
TMR0H_TMR0H0_LENGTH                      equ 0001h
TMR0H_TMR0H0_MASK                        equ 0001h
TMR0H_TMR0H1_POSN                        equ 0001h
TMR0H_TMR0H1_POSITION                    equ 0001h
TMR0H_TMR0H1_SIZE                        equ 0001h
TMR0H_TMR0H1_LENGTH                      equ 0001h
TMR0H_TMR0H1_MASK                        equ 0002h
TMR0H_TMR0H2_POSN                        equ 0002h
TMR0H_TMR0H2_POSITION                    equ 0002h
TMR0H_TMR0H2_SIZE                        equ 0001h
TMR0H_TMR0H2_LENGTH                      equ 0001h
TMR0H_TMR0H2_MASK                        equ 0004h
TMR0H_TMR0H3_POSN                        equ 0003h
TMR0H_TMR0H3_POSITION                    equ 0003h
TMR0H_TMR0H3_SIZE                        equ 0001h
TMR0H_TMR0H3_LENGTH                      equ 0001h
TMR0H_TMR0H3_MASK                        equ 0008h
TMR0H_TMR0H4_POSN                        equ 0004h
TMR0H_TMR0H4_POSITION                    equ 0004h
TMR0H_TMR0H4_SIZE                        equ 0001h
TMR0H_TMR0H4_LENGTH                      equ 0001h
TMR0H_TMR0H4_MASK                        equ 0010h
TMR0H_TMR0H5_POSN                        equ 0005h
TMR0H_TMR0H5_POSITION                    equ 0005h
TMR0H_TMR0H5_SIZE                        equ 0001h
TMR0H_TMR0H5_LENGTH                      equ 0001h
TMR0H_TMR0H5_MASK                        equ 0020h
TMR0H_TMR0H6_POSN                        equ 0006h
TMR0H_TMR0H6_POSITION                    equ 0006h
TMR0H_TMR0H6_SIZE                        equ 0001h
TMR0H_TMR0H6_LENGTH                      equ 0001h
TMR0H_TMR0H6_MASK                        equ 0040h
TMR0H_TMR0H7_POSN                        equ 0007h
TMR0H_TMR0H7_POSITION                    equ 0007h
TMR0H_TMR0H7_SIZE                        equ 0001h
TMR0H_TMR0H7_LENGTH                      equ 0001h
TMR0H_TMR0H7_MASK                        equ 0080h
TMR0H_T0PR0_POSN                         equ 0000h
TMR0H_T0PR0_POSITION                     equ 0000h
TMR0H_T0PR0_SIZE                         equ 0001h
TMR0H_T0PR0_LENGTH                       equ 0001h
TMR0H_T0PR0_MASK                         equ 0001h
TMR0H_T0PR1_POSN                         equ 0001h
TMR0H_T0PR1_POSITION                     equ 0001h
TMR0H_T0PR1_SIZE                         equ 0001h
TMR0H_T0PR1_LENGTH                       equ 0001h
TMR0H_T0PR1_MASK                         equ 0002h
TMR0H_T0PR2_POSN                         equ 0002h
TMR0H_T0PR2_POSITION                     equ 0002h
TMR0H_T0PR2_SIZE                         equ 0001h
TMR0H_T0PR2_LENGTH                       equ 0001h
TMR0H_T0PR2_MASK                         equ 0004h
TMR0H_T0PR3_POSN                         equ 0003h
TMR0H_T0PR3_POSITION                     equ 0003h
TMR0H_T0PR3_SIZE                         equ 0001h
TMR0H_T0PR3_LENGTH                       equ 0001h
TMR0H_T0PR3_MASK                         equ 0008h
TMR0H_T0PR4_POSN                         equ 0004h
TMR0H_T0PR4_POSITION                     equ 0004h
TMR0H_T0PR4_SIZE                         equ 0001h
TMR0H_T0PR4_LENGTH                       equ 0001h
TMR0H_T0PR4_MASK                         equ 0010h
TMR0H_T0PR5_POSN                         equ 0005h
TMR0H_T0PR5_POSITION                     equ 0005h
TMR0H_T0PR5_SIZE                         equ 0001h
TMR0H_T0PR5_LENGTH                       equ 0001h
TMR0H_T0PR5_MASK                         equ 0020h
TMR0H_T0PR6_POSN                         equ 0006h
TMR0H_T0PR6_POSITION                     equ 0006h
TMR0H_T0PR6_SIZE                         equ 0001h
TMR0H_T0PR6_LENGTH                       equ 0001h
TMR0H_T0PR6_MASK                         equ 0040h
TMR0H_T0PR7_POSN                         equ 0007h
TMR0H_T0PR7_POSITION                     equ 0007h
TMR0H_T0PR7_SIZE                         equ 0001h
TMR0H_T0PR7_LENGTH                       equ 0001h
TMR0H_T0PR7_MASK                         equ 0080h
TMR0H_T0PR_POSN                          equ 0000h
TMR0H_T0PR_POSITION                      equ 0000h
TMR0H_T0PR_SIZE                          equ 0008h
TMR0H_T0PR_LENGTH                        equ 0008h
TMR0H_T0PR_MASK                          equ 00FFh

// Register: T0CON0
#define T0CON0 T0CON0
T0CON0                                   equ 059Eh
// bitfield definitions
T0CON0_OUTPS_POSN                        equ 0000h
T0CON0_OUTPS_POSITION                    equ 0000h
T0CON0_OUTPS_SIZE                        equ 0004h
T0CON0_OUTPS_LENGTH                      equ 0004h
T0CON0_OUTPS_MASK                        equ 000Fh
T0CON0_MD16_POSN                         equ 0004h
T0CON0_MD16_POSITION                     equ 0004h
T0CON0_MD16_SIZE                         equ 0001h
T0CON0_MD16_LENGTH                       equ 0001h
T0CON0_MD16_MASK                         equ 0010h
T0CON0_OUT_POSN                          equ 0005h
T0CON0_OUT_POSITION                      equ 0005h
T0CON0_OUT_SIZE                          equ 0001h
T0CON0_OUT_LENGTH                        equ 0001h
T0CON0_OUT_MASK                          equ 0020h
T0CON0_EN_POSN                           equ 0007h
T0CON0_EN_POSITION                       equ 0007h
T0CON0_EN_SIZE                           equ 0001h
T0CON0_EN_LENGTH                         equ 0001h
T0CON0_EN_MASK                           equ 0080h
T0CON0_T0OUTPS_POSN                      equ 0000h
T0CON0_T0OUTPS_POSITION                  equ 0000h
T0CON0_T0OUTPS_SIZE                      equ 0004h
T0CON0_T0OUTPS_LENGTH                    equ 0004h
T0CON0_T0OUTPS_MASK                      equ 000Fh
T0CON0_T0MD16_POSN                       equ 0004h
T0CON0_T0MD16_POSITION                   equ 0004h
T0CON0_T0MD16_SIZE                       equ 0001h
T0CON0_T0MD16_LENGTH                     equ 0001h
T0CON0_T0MD16_MASK                       equ 0010h
T0CON0_T0OUT_POSN                        equ 0005h
T0CON0_T0OUT_POSITION                    equ 0005h
T0CON0_T0OUT_SIZE                        equ 0001h
T0CON0_T0OUT_LENGTH                      equ 0001h
T0CON0_T0OUT_MASK                        equ 0020h
T0CON0_T0EN_POSN                         equ 0007h
T0CON0_T0EN_POSITION                     equ 0007h
T0CON0_T0EN_SIZE                         equ 0001h
T0CON0_T0EN_LENGTH                       equ 0001h
T0CON0_T0EN_MASK                         equ 0080h
T0CON0_OUTPS0_POSN                       equ 0000h
T0CON0_OUTPS0_POSITION                   equ 0000h
T0CON0_OUTPS0_SIZE                       equ 0001h
T0CON0_OUTPS0_LENGTH                     equ 0001h
T0CON0_OUTPS0_MASK                       equ 0001h
T0CON0_OUTPS1_POSN                       equ 0001h
T0CON0_OUTPS1_POSITION                   equ 0001h
T0CON0_OUTPS1_SIZE                       equ 0001h
T0CON0_OUTPS1_LENGTH                     equ 0001h
T0CON0_OUTPS1_MASK                       equ 0002h
T0CON0_OUTPS2_POSN                       equ 0002h
T0CON0_OUTPS2_POSITION                   equ 0002h
T0CON0_OUTPS2_SIZE                       equ 0001h
T0CON0_OUTPS2_LENGTH                     equ 0001h
T0CON0_OUTPS2_MASK                       equ 0004h
T0CON0_OUTPS3_POSN                       equ 0003h
T0CON0_OUTPS3_POSITION                   equ 0003h
T0CON0_OUTPS3_SIZE                       equ 0001h
T0CON0_OUTPS3_LENGTH                     equ 0001h
T0CON0_OUTPS3_MASK                       equ 0008h
T0CON0_T016BIT_POSN                      equ 0004h
T0CON0_T016BIT_POSITION                  equ 0004h
T0CON0_T016BIT_SIZE                      equ 0001h
T0CON0_T016BIT_LENGTH                    equ 0001h
T0CON0_T016BIT_MASK                      equ 0010h

